ekawahyu/HALMX_Arduino_STM32/HALMX/boards.txt
NodinoF072RobotBase.menu.upload_method.OpenOCDJLinkMethod=OpenOCD-JLink
NodinoF072RobotBase.menu.upload_method.OpenOCDJLinkMethod.upload.protocol=OpenOCD
NodinoF072RobotBase.menu.upload_method.OpenOCDJLinkMethod.upload.transport=swd
NodinoF072RobotBase.menu.upload_method.OpenOCDJLinkMethod.upload.tool=openocd_upload
NodinoF072RobotBase.menu.upload_method.OpenOCDJLinkMethod.upload.interface=jlink
NodinoF072RobotBase.menu.upload_method.OpenOCDJLinkMethod.upload.target=stm32f0x

NodinoF072RobotBase.menu.upload_method.DFUUploadMethod=STM32DFU
NodinoF072RobotBase.menu.upload_method.DFUUploadMethod.upload.protocol=STM32DFU
NodinoF072RobotBase.menu.upload_method.DFUUploadMethod.upload.tool=dfu_upload
NodinoF072RobotBase.menu.upload_method.DFUUploadMethod.upload.usbID=0483:df11
NodinoF072RobotBase.menu.upload_method.DFUUploadMethod.upload.altID=0

##############################################################
NodinoF072LED.name=F072-LED

NodinoF072LED.upload.file_type=bin
NodinoF072LED.upload.flash.maximum_size=64k
NodinoF072LED.upload.ram.maximum_size=16k

NodinoF072LED.build.mcu=cortex-m0
NodinoF072LED.build.f_cpu=48000000L
NodinoF072LED.build.board=HALMX_NODINOF072LED
NodinoF072LED.build.core=mapleMX
NodinoF072LED.build.variant=NodinoF072LED

NodinoF072LED.build.CMSISInc=STM32F0xx/Include
NodinoF072LED.build.DRIVERS=STM32F0xx_HAL_Driver/Inc
NodinoF072LED.build.common_flags=-mthumb -D__STM32F0__
NodinoF072LED.build.extra_flags=-DSTM32F072xB
NodinoF072LED.build.ldscript=SW4STM32/NodinoF072LED/STM32F072C8Tx_FLASH.ld

NodinoF072LED.menu.upload_method.STLinkMethod=STLink
NodinoF072LED.menu.upload_method.STLinkMethod.upload.protocol=STLink
NodinoF072LED.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

NodinoF072LED.menu.upload_method.OpenOCDSTLinkMethod=OpenOCD-STLink
NodinoF072LED.menu.upload_method.OpenOCDSTLinkMethod.upload.protocol=OpenOCD
NodinoF072LED.menu.upload_method.OpenOCDSTLinkMethod.upload.transport=swd
NodinoF072LED.menu.upload_method.OpenOCDSTLinkMethod.upload.tool=openocd_upload
NodinoF072LED.menu.upload_method.OpenOCDSTLinkMethod.upload.interface=stlink-v2
NodinoF072LED.menu.upload_method.OpenOCDSTLinkMethod.upload.target=stm32f0x

NodinoF072LED.menu.upload_method.OpenOCDJLinkMethod=OpenOCD-JLink
NodinoF072LED.menu.upload_method.OpenOCDJLinkMethod.upload.protocol=OpenOCD
NodinoF072LED.menu.upload_method.OpenOCDJLinkMethod.upload.transport=swd
NodinoF072LED.menu.upload_method.OpenOCDJLinkMethod.upload.tool=openocd_upload
NodinoF072LED.menu.upload_method.OpenOCDJLinkMethod.upload.interface=jlink
NodinoF072LED.menu.upload_method.OpenOCDJLinkMethod.upload.target=stm32f0x

NodinoF072LED.menu.upload_method.DFUUploadMethod=STM32DFU
NodinoF072LED.menu.upload_method.DFUUploadMethod.upload.protocol=STM32DFU
NodinoF072LED.menu.upload_method.DFUUploadMethod.upload.tool=dfu_upload
NodinoF072LED.menu.upload_method.DFUUploadMethod.upload.usbID=0483:df11
NodinoF072LED.menu.upload_method.DFUUploadMethod.upload.altID=0

##############################################################
MXDiscoF072RBTx.name=STM32F072B-DISCO

MXDiscoF072RBTx.upload.file_type=bin
MXDiscoF072RBTx.upload.flash.maximum_size=128k
MXDiscoF072RBTx.upload.ram.maximum_size=20k

MXDiscoF072RBTx.build.mcu=cortex-m0
MXDiscoF072RBTx.build.f_cpu=48000000L
MXDiscoF072RBTx.build.board=HALMX_MXDISCOF072RBTX
MXDiscoF072RBTx.build.core=mapleMX
MXDiscoF072RBTx.build.variant=MXDiscoF072RBTx

MXDiscoF072RBTx.build.CMSISInc=STM32F0xx/Include
MXDiscoF072RBTx.build.DRIVERS=STM32F0xx_HAL_Driver/Inc
MXDiscoF072RBTx.build.common_flags=-mthumb -D__STM32F0__
MXDiscoF072RBTx.build.extra_flags=-DSTM32F072xB
MXDiscoF072RBTx.build.ldscript=SW4STM32/MXDiscoF072RBTx/STM32F072RBTx_FLASH.ld

MXDiscoF072RBTx.menu.upload_method.STLinkMethod=STLink
MXDiscoF072RBTx.menu.upload_method.STLinkMethod.upload.protocol=STLink
MXDiscoF072RBTx.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

MXDiscoF072RBTx.menu.upload_method.OpenOCDSTLinkMethod=OpenOCD-STLink
MXDiscoF072RBTx.menu.upload_method.OpenOCDSTLinkMethod.upload.protocol=OpenOCD
MXDiscoF072RBTx.menu.upload_method.OpenOCDSTLinkMethod.upload.transport=swd
MXDiscoF072RBTx.menu.upload_method.OpenOCDSTLinkMethod.upload.tool=openocd_upload
MXDiscoF072RBTx.menu.upload_method.OpenOCDSTLinkMethod.upload.interface=stlink-v2
MXDiscoF072RBTx.menu.upload_method.OpenOCDSTLinkMethod.upload.target=stm32f0x

MXDiscoF072RBTx.menu.upload_method.DFUUploadMethod=STM32DFU
MXDiscoF072RBTx.menu.upload_method.DFUUploadMethod.upload.protocol=STM32DFU
MXDiscoF072RBTx.menu.upload_method.DFUUploadMethod.upload.tool=dfu_upload
MXDiscoF072RBTx.menu.upload_method.DFUUploadMethod.upload.usbID=0483:df11
MXDiscoF072RBTx.menu.upload_method.DFUUploadMethod.upload.altID=0

##############################################################
#MXNucleoF401.name=STM Nucleo F401RE (HALMX)

#MXNucleoF401.upload.tool=stlink_upload
#MXNucleoF401.upload.protocol=maple_dfu
#MXNucleoF401.upload.maximum_size=480000

#MXNucleoF401.upload.file_type=bin
#MXNucleoF401.upload.ram.maximum_size=97000
#MXNucleoF401.upload.flash.maximum_size=500000
#MXNucleoF401.upload.params.quiet=no

#MXNucleoF401.build.mcu=cortex-m4
#MXNucleoF401.build.f_cpu=84000000L
#MXNucleoF401.build.board=STM_NUCLEO_F401RE
#MXNucleoF401.build.core=mapleMX
#MXNucleoF401.build.common_flags=-mthumb  -D__STM32F4__ 

#MXNucleoF401.build.extra_flags=-DSTM32F401xE -DSTM32_MEDIUM_DENSITY -DSTM32F2 -DBOARD_NUCLEO_F401RE

#MXNucleoF401.build.ldscript=SW4STM32/MxNucleoF401 Configuration/STM32F401RETx_FLASH.ld
#MXNucleoF401.build.variant=MXNucleoF401
#MXNucleoF401.build.variant_system_lib=lib_f401.a

#MXNucleoF401.build.CMSISInc=STM32F4xx/Include
#MXNucleoF401.build.DRIVERS=STM32F4xx_HAL_Driver/Inc


##MXNucleoF401.build.vect=VECT_TAB_BASE
##MXNucleoF401.build.density=STM32_MEDIUM_DENSITY
##MXNucleoF401.build.error_led_port=GPIOA
##MXNucleoF401.build.error_led_pin=5

##############################################################
#MXNucleoF103.name=STM Nucleo F103RB (HALMX)

#MXNucleoF103.upload.tool=stlink_upload
#MXNucleoF103.upload.protocol=maple_dfu
#MXNucleoF103.upload.maximum_size=108000

#MXNucleoF103.upload.file_type=bin
#MXNucleoF103.upload.ram.maximum_size=20000
#MXNucleoF103.upload.flash.maximum_size=128000
#MXNucleoF103.upload.params.quiet=no

